---
title: "Working-with-text-data"
author: "Palaniappan S"
date: 2020-09-04
description: "-"
type: technical_note
draft: false
---

In [1]:
import numpy as np
import scipy.stats
import pandas as pd
import sklearn

In [2]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

s

0             Tom
1    William Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [3]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [4]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])

s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [5]:
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [6]:
s = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
s

0             Tom
1     William Rick
2             John
3          Alber@t
dtype: object

In [7]:
s.str.strip()

0             Tom
1    William Rick
2            John
3         Alber@t
dtype: object

In [8]:
s.str.split(' ')

0              [Tom, ]
1    [, William, Rick]
2               [John]
3            [Alber@t]
dtype: object

In [9]:
s.str.cat(sep='_')

'Tom _ William Rick_John_Alber@t'

In [10]:
s.str.get_dummies()

    William Rick  Alber@t  John  Tom
0              0        0     0     1
1              1        0     0     0
2              0        0     1     0
3              0        1     0     0

In [11]:
s.str.contains(' ')

0     True
1     True
2    False
3    False
dtype: bool

In [12]:
s.str.replace('@','$')

0             Tom
1     William Rick
2             John
3          Alber$t
dtype: object

In [13]:
s.str.repeat(2)

0                      Tom Tom
1     William Rick William Rick
2                      JohnJohn
3                Alber@tAlber@t
dtype: object

In [14]:
s.str.find('e')

0   -1
1   -1
2   -1
3    3
dtype: int64

In [15]:
s.str.swapcase()

0             tOM
1     wILLIAM rICK
2             jOHN
3          aLBER@T
dtype: object

In [16]:
 s.str.isnumeric()

0    False
1    False
2    False
3    False
dtype: bool